Repository: chaima-amali/MediGo
Catalog: frontend/lib/l10n/app_*.arb
Languages: ar

source: Get Started
ar: ابدأ

source: Find Nearby Pharmacies
ar: ابحث عن صيدليات قريبة

# discoverPharmaciesDescription
source: Discover pharmacies near you with real-time distance tracking and easy navigation.
ar: اكتشف الصيدليات القريبة منك مع تتبع المسافة في الوقت الفعلي والملاحة السهلة.

source: Next
ar: التالي

source: Skip
ar: تخطي

# searchMedicines
source: Search for Medicines
ar: ابحث عن الأدوية

# searchMedicinesDescription
source: Quickly find the medicines you need with our smart search feature.
ar: ابحث بسرعة عن الأدوية التي تحتاجها باستخدام ميزة البحث الذكية لدينا.

source: Medicine Reminders
ar: تذكيرات الأدوية

# medicineRemindersDescription
source: Never miss your medication with personalized reminders and treatment tracking.
ar: لا تفوت أبداً موعد دوائك مع التذكيرات الشخصية وتتبع العلاج.

source: Contact & Directions
ar: الاتصال والاتجاهات

# contactDirectionsDescription
source: Get detailed pharmacy information, directions, and contact them directly from the app.
ar: احصل على معلومات مفصلة عن الصيدلية والاتجاهات واتصل بهم مباشرة من التطبيق.

# noAccountFound
source: No account found for that email
ar: لم يتم العثور على حساب لهذا البريد الإلكتروني

source: Welcome To
ar: مرحباً بك في

source: Log In
ar: تسجيل الدخول

source: Email
ar: البريد الإلكتروني

# pleaseEnterEmail
source: Please enter your email
ar: الرجاء إدخال بريدك الإلكتروني

# validEmail
source: Please enter a valid email
ar: الرجاء إدخال بريد إلكتروني صالح

source: Password
ar: كلمة المرور

# enterPassword
source: Please enter your password
ar: الرجاء إدخال كلمة المرور

source: Forget Password?
ar: نسيت كلمة المرور؟

source: Or Log in with
ar: أو سجل الدخول باستخدام

# noAccount
source: You don't have an account?
ar: ليس لديك حساب؟

source: Sign Up
ar: سجل

source: Full Name
ar: الاسم الكامل

# enterFullName
source: Enter your Full Name
ar: أدخل اسمك الكامل

# pleaseEnterName
source: Please enter your name
ar: الرجاء إدخال اسمك

# enterEmail
source: Enter your Email
ar: أدخل بريدك الإلكتروني

source: Phone Number
ar: رقم الهاتف

# enterPhoneNumber
source: Please enter your phone number
ar: الرجاء إدخال رقم هاتفك

source: Or sign up with
ar: أو سجل باستخدام

# alreadyHaveAccount
source: You already have an account?
ar: لديك حساب بالفعل؟

# selectGenderPrompt
source: Please select your gender
ar: الرجاء اختيار جنسك

# selectDOBPrompt
source: Please select your date of birth
ar: الرجاء اختيار تاريخ ميلادك

source: Gender
ar: الجنس

source: Select Gender
ar: اختر الجنس

source: Select
ar: اختر

source: Male
ar: ذكر

source: Female
ar: أنثى

source: Other
ar: آخر

source: Location
ar: الموقع

source: Date Of Birth
ar: تاريخ الميلاد

# dobFormat
source: jj/dd/yyyy
ar: يي/شش/سسسس

# createPassword
source: Create your password
ar: أنشئ كلمة المرور الخاصة بك

# passwordMinLength
source: Password must be at least 6 characters
ar: يجب أن تتكون كلمة المرور من 6 أحرف على الأقل

source: Confirm Password
ar: تأكيد كلمة المرور

source: Confirm your password
ar: أكد كلمة المرور الخاصة بك

source: Passwords do not match
ar: كلمات المرور غير متطابقة

source: Hi
ar: مرحباً

# howAreYouFeeling
source: ,How are you feeling Today?
ar: ،كيف حالك aليوم؟

# searchMedicinePrompt
source: Search for your medicine ...
ar: ابحث عن دوائك ...

# medicineReminder
source: Medicine Remainder
ar: تذكير بالدواء

# reminderDescription
source: You want a Remainder to track your treatment
ar: تريد تذكيراً لتتبع علاجك

source: Start Now
ar: ابدأ الآن

source: Nearby Pharmacy
ar: صيدلية قريبة

# rating
source: Rating: $rating
ar: التقييم: $rating

source: Find your medicine
ar: ابحث عن دوائك

source: Search your medicine
ar: ابحث عن دوائك

source: No results found
ar: لم يتم العثور على نتائج

source: In stock
ar: متوفر

source: Out of stock
ar: نفذت الكمية

source: Pre Order
ar: الطلب المسبق

source: Pharmacy id missing
ar: معرف الصيدلية مفقود

source: Profile Screen
ar: شاشة الملف الشخصي

source: Calendar Screen
ar: شاشة التقويم

# logoutConfirmation
source: Are you sure you want to log out?
ar: هل أنت متأكد أنك تريد تسجيل الخروج؟

source: Cancel
ar: إلغاء

source: Log Out
ar: تسجيل الخروج

source: Not specified
ar: غير محدد

source: Profile
ar: الملف الشخصي

source: Premium Plan
ar: الخطة المميزة

source: Free Plan
ar: الخطة المجانية

source: Edit Profile
ar: تعديل الملف الشخصي

source: Upgrade to Premium
ar: الترقية إلى المميز

# premiumDescription
source: Unlock exclusive features and enhance your medicine management
ar: احصل على تجربة خالية من الإعلانات، حجوزات ذات أولوية وتنبيهات فورية لإعادة التخزين

# upgradeNowPrice
source: Upgrade Now - 3000DA/year
ar: قم بالترقية الآن - 3000دج/سنة

source: Settings
ar: الإعدادات

source: My Reservations
ar: حجوزاتي

# activeReservations
source: $activeReservationsCount active reservations
ar: $activeReservationsCount حجوزات نشطة

source: Notifications
ar: الإشعارات

source: Receive medicine reminders
ar: تلقي تذكيرات الأدوية

source: Dark Mode
ar: الوضع الداكن

# darkModeDescription
source: Switch to dark theme
ar: التبديل إلى السمة الداكنة

source: Language
ar: اللغة

source: Privacy & Security Page
ar: صفحة الخصوصية والأمان

source: Privacy & Security
ar: الخصوصية والأمان

# privacySecurityDescription
source: Manage your data Privacy & Security Page
ar: إدارة خصوصية بياناتك وصفحة الأمان

source: About MediGo
ar: حول MediGo

source: About MediGo Page
ar: صفحة حول MediGo

# profileUpdated
source: Profile updated successfully
ar: تم تحديث الملف الشخصي بنجاح

source: New password
ar: كلمة مرور جديدة

# enterNewPassword
source: Enter your new password
ar: أدخل كلمة المرور الجديدة

source: Confirm new password
ar: تأكيد كلمة المرور الجديدة

# enterConfirmNewPassword
source: Confirm your new password
ar: أكد كلمة المرور الجديدة

# pleaseConfirmPassword
source: Please confirm your password
ar: الرجاء تأكيد كلمة المرور

source: Subscription
ar: الاشتراك

source: Choose Your Plan
ar: اختر خطتك

# subscriptionAgreement
source: By subscribing, you agree to our Terms of Service and Privacy Policy. Subscription auto-renews unless cancelled.
ar: من خلال الاشتراك، فإنك توافق على شروط الخدمة وسياسة الخصوصية الخاصة بنا. يتم تجديد الاشتراك تلقائياً ما لم يتم إلغاؤه.

source: Subscribe Monthly
ar: اشترك شهرياً

source: Billed annually
ar: يتم إصدار الفاتورة سنوياً

source: Yearly
ar: سنوي

source: Monthly
ar: شهري

source: Billed monthly
ar: يتم إصدار الفاتورة شهرياً

# perMonth
source: /month
ar: /شهر

source: per year
ar: في السنة

# subscribeYearly
source: Subscribe Yearly (Best Value)
ar: اشترك سنوياً (أفضل قيمة)

source: Success!
ar: نجاح!

source: OK
ar: حسناً

# subscriptionSuccessMessage
source: Youâ€™ve successfully subscribed to the $planName plan!
ar: لقد اشتركت بنجاح في خطة $planName!

source: Medicine pre-order & reservation
ar: الطلب المسبق وحجز الأدوية

# medicinePreOrderDescription
source: pre-order your medicine and reserve it then go for pick up when you are free
ar: اطلب مسبقاً دواءك واحجزه ثم اذهب لاستلامه عندما تكون متفرغاً

source: Instant Restock Alerts
ar: تنبيهات فورية لإعادة التخزين

# instantRestockDescription
source: Get notified immediately when out-of-stock medicines are available
ar: احصل على إشعار فوري عندما تتوفر الأدوية غير المتوفرة في المخزون

source: Ad-Free Experience
ar: تجربة خالية من الإعلانات

# adFreeDescription
source: Enjoy a clean, distraction-free interface without any ads
ar: استمتع بواجهة نظيفة وخالية من الإلهاء بدون أي إعلانات

source: Your Location?
ar: موقعك؟

# locationRequiredMessage
source: This app requires your location to function properly. Please allow location access.
ar: يتطلب هذا التطبيق موقعك ليعمل بشكل صحيح. يرجى السماح بالوصول إلى الموقع.

source: Allow Location Access
ar: السماح بالوصول إلى الموقع

source: Enter Location Manually
ar: أدخل الموقع يدوياً

# locationServicesDisabled
source: Location services are disabled. Please enable them in settings.
ar: خدمات الموقع معطلة. يرجى تمكينها في الإعدادات.

source: Location permission denied
ar: تم رفض إذن الموقع

# locationPermissionPermanentlyDenied
source: Location permission permanently denied. Please enable it in app settings.
ar: تم رفض إذن الموقع بشكل دائم. يرجى تمكينه في إعدادات التطبيق.

source: Error getting location
ar: خطأ في الحصول على الموقع

source: Search your location
ar: ابحث عن موقعك

# searchLocationHint
source: eg: Algiers,Algeria
ar: مثال: الجزائر، الجزائر

# useCurrentLocation
source: Use my current location
ar: استخدم موقعي الحالي

source: Search results
ar: نتائج البحث

source: Error saving location
ar: خطأ في حفظ الموقع

source: Old password
ar: كلمة المرور القديمة

# enterOldPassword
source: Enter your old password
ar: أدخل كلمة المرور القديمة

source: Change Password
ar: تغيير كلمة المرور

source: Incorrect old password
ar: كلمة المرور القديمة غير صحيحة

source: Password changed successfully
ar: تم تغيير كلمة المرور بنجاح

source: Active
ar: نشط

source: Completed
ar: مكتمل

source: Cancelled
ar: ملغى

source: Pending
ar: قيد الانتظار

source: Confirmed
ar: مؤكد

source: Status Guide
ar: دليل الحالة

source: Quantity
ar: الكمية

source: Pickup
ar: الاستلام

source: at
ar: في

source: No active reservations
ar: لا توجد حجوزات نشطة

source: No completed reservations
ar: لا توجد حجوزات مكتملة

source: No cancelled reservations
ar: لا توجد حجوزات ملغاة

source: Your reservations will appear here
ar: ستظهر حجوزاتك هنا

# pendingDescription
source: Reservation request submitted and waiting for pharmacy confirmation. You'll be notified once confirmed.
ar: تم تقديم طلب الحجز وفي انتظار تأكيد الصيدلية. سيتم إعلامك بمجرد التأكيد.

# confirmedDescription
source: Pharmacy has confirmed your reservation. Medicine is ready for pickup at the scheduled date and time.
ar: أكدت الصيدلية حجزك. الدواء جاهز للاستلام في التاريخ والوقت المحددين.

# completedDescription
source: You've successfully picked up the medicine from the pharmacy. Reservation is now complete.
ar: لقد استلمت الدواء بنجاح من الصيدلية. الحجز مكتمل الآن.

# cancelledDescription
source: Reservation was cancelled either by you, the pharmacy, or due to expiration. Medicine is no longer reserved.
ar: تم إلغاء الحجز إما من قبلك أو الصيدلية أو بسبب انتهاء الصلاحية. لم يعد الدواء محجوزاً.

source: Reservation Details
ar: تفاصيل الحجز

source: Cancel Reservation
ar: إلغاء الحجز

# cancelReservationQuestion
source: Cancel Reservation?
ar: إلغاء الحجز؟

# cancelReservationConfirmation
source: Are you sure you want to cancel this reservation? This action cannot be undone.
ar: هل أنت متأكد من أنك تريد إلغاء هذا الحجز؟ لا يمكن التراجع عن هذا الإجراء.

# yesCancelReservation
source: Yes, Cancel
ar: نعم، إلغاء

source: Keep Reservation
ar: الاحتفاظ بالحجز

source: Reservation cancelled successfully
ar: تم إلغاء الحجز بنجاح

source: Reservation not found
ar: لم يتم العثور على الحجز

source: Unknown Pharmacy
ar: صيدلية غير معروفة

source: Pickup Date
ar: تاريخ الاستلام

source: Pickup Time
ar: وقت الاستلام

source: Pharmacy Information
ar: معلومات الصيدلية

source: Awaiting Confirmation
ar: في انتظار التأكيد

# awaitingConfirmationMessage
source: The pharmacy will confirm your reservation shortly. You will be notified once it's ready.
ar: ستؤكد الصيدلية حجزك قريباً. سيتم إعلامك بمجرد أن يصبح جاهزاً.

source: Get Directions
ar: الحصول على الاتجاهات

source: Opening directions...
ar: فتح الاتجاهات...

source: Contact Pharmacy
ar: الاتصال بالصيدلية

source: Calling
ar: جاري الاتصال

source: Reservation ID
ar: معرف الحجز

source: Created
ar: تم الإنشاء

source: Reserve Medicine
ar: حجز دواء

# completeFormMessage
source: Complete the form to reserve your medicine
ar: أكمل النموذج لحجز دوائك

# completeForm
source: Complete the form to reserve your medicine
ar: أكمل النموذج لحجز دوائك

source: Medicine Name
ar: اسم الدواء

# pharmacyHoursInfo
source: Pharmacy Hours
ar: ساعات عمل الصيدلية

source: Open Hours
ar: ساعات العمل

# nextButton
source: Next
ar: التالي

source: Pickup Code
ar: رمز الاستلام

source: Copy Code
ar: نسخ الرمز

# showQRCode
source: Show QR Code for Scanning
ar: إظهار رمز الاستجابة السريعة للمسح

# showQrCode
source: Show QR Code for Scanning
ar: إظهار رمز الاستجابة السريعة للمسح

# showCodeAtPickup
source: Show this code at pickup.
ar: أظهر هذا الرمز عند الاستلام.

source: Ready for Pickup
ar: جاهز للاستلام

# readyForPickupMessage
source: Your medicine will be ready around 1 hour before the selected pickup time
ar: سيكون دواؤك جاهزاً حوالي 1 ساعة قبل وقت الاستلام المحدد

# needConsultation
source: Need a Consultation
ar: بحاجة إلى استشارة

source: Reservation Instructions
ar: تعليمات الحجز

# reservationInstructions1
source: Your reservation ID and QR code with a unique 6-digit verification code
ar: معرف حجزك ورمز الاستجابة السريعة مع رمز تحقق فريد مكون من 6 أرقام

# reservationInstructions2
source: When you arrive at the pharmacy, show your code. Our staff will verify your code or QR code in the text
ar: عندما تصل إلى الصيدلية، أظهر رمزك. سيتحقق موظفونا من رمزك أو رمز الاستجابة السريعة في النص

# reservationInstructions3
source: The pharmacy will verify your code and your identity (ID may be required)
ar: ستتحقق الصيدلية من رمزك وهويتك (قد تكون هناك حاجة إلى بطاقة الهوية)

# reservationInstructions4
source: Once verified the staff will give your medicine and you can mark the order as completed
ar: بمجرد التحقق، سيعطيك الموظفون دواءك ويمكنك وضع علامة على الطلب كمكتمل

# step1
source: Your reservation ID and QR code with a unique 6-digit verification code
ar: معرف حجزك ورمز الاستجابة السريعة مع رمز تحقق فريد مكون من 6 أرقام

# step2
source: When you arrive at the pharmacy, show your code. Our staff will verify your code or QR code in the text
ar: عندما تصل إلى الصيدلية، أظهر رمزك. سيتحقق موظفونا من رمزك أو رمز الاستجابة السريعة في النص

# step3
source: The pharmacy will verify your code and your identity (ID may be required)
ar: ستتحقق الصيدلية من رمزك وهويتك (قد تكون هناك حاجة إلى بطاقة الهوية)

# step4
source: Once verified the staff will give your medicine and you can mark the order as completed
ar: بمجرد التحقق، سيعطيك الموظفون دواءك ويمكنك وضع علامة على الطلب كمكتمل

# securityNote
source: Note: your verification code is valid. Never share your code with anyone. Keep this code secure.
ar: ملاحظة: رمز التحقق الخاص بك صالح. لا تشارك رمزك مع أي شخص أبداً. احتفظ بهذا الرمز آمناً.

# verificationNote
source: Note: your verification code is valid. Never share your code with anyone. Keep this code secure.
ar: ملاحظة: رمز التحقق الخاص بك صالح. لا تشارك رمزك مع أي شخص أبداً. احتفظ بهذا الرمز آمناً.

source: Reserved on
ar: محجوز في

source: Picked up successfully.
ar: تم الاستلام بنجاح.

source: Open 24 hours
ar: مفتوح 24 ساعة

source: Enter medicine name
ar: أدخل اسم الدواء

source: Enter quantity
ar: أدخل الكمية

# pickupTimeDuringHours
source: Please select a pickup time during pharmacy hours
ar: يرجى اختيار وقت الاستلام خلال ساعات عمل الصيدلية

source: Reservation confirmed!
ar: تم تأكيد الحجز!

source: Confirm Reservation
ar: تأكيد الحجز

# selectDateAndTime
source: Please select date and time
ar: يرجى اختيار التاريخ والوقت

source: Secure Pickup Process
ar: عملية استلام آمنة

# reserveCancelQuestion
source: Cancel Reservation?
ar: إلغاء الحجز؟

# reservationCancelledSuccess
source: Reservation cancelled successfully
ar: تم إلغاء الحجز بنجاح

# pharmacyWillConfirm
source: The pharmacy will confirm your reservation shortly. You will be notified once it's ready.
ar: ستؤكد الصيدلية حجزك قريباً. سيتم إعلامك بمجرد أن يصبح جاهزاً.

source: Your current medicines
ar: أدويتك الحالية

source: tracking
ar: التتبع

source: Edit
ar: تعديل

source: statistics
ar: الإحصائيات

# haveYouTakentYourMedicineToday
source: Have you taken your medicine today ?
ar: هل تناولت دواءك اليوم؟

source: Morning
ar: صباح

source: Evening
ar: مساء

source: Add Medicine
ar: إضافة دواء

source: Medicine Type
ar: نوع الدواء

source: Dose
ar: الجرعة

# enterDoseExample
source: e.g., 500
ar: مثال: 500

source: Unit
ar: الوحدة

source: Frequency
ar: التكرار

# timesPerDay
source: How many times per day
ar: كم مرة في اليوم

source: Time
ar: الوقت

source: Select time
ar: اختر الوقت

source: Start Date
ar: تاريخ البداية

source: End Date
ar: تاريخ الانتهاء

source: Select date
ar: اختر التاريخ

source: Importance
ar: الأهمية

source: Notes
ar: الملاحظات

# enterNotes
source: Write a note (optional)
ar: اكتب ملاحظة (اختياري)

source: Save
ar: حفظ

source: Per day
ar: في اليوم

source: Per week
ar: في الأسبوع

source: Each N days
ar: كل N أيام

source: Customized
ar: مخصص

source: Your progress
ar: تقدمك

source: Med Progress
ar: تقدم الأدوية

source: Add
ar: إضافة

# no_medicines_for_day
source: No medicines for this day
ar: لا توجد أدوية لهذا اليوم

# cannot_update_item
source: Cannot update this item
ar: لا يمكن تحديث هذا العنصر

source: Marked as done
ar: تم وضع علامة كمكتمل

source: Unmarked
ar: تم إلغاء العلامة

# failed_to_mark
source: Failed to mark as done
ar: فشل وضع علامة كمكتمل

source: Failed to unmark
ar: فشل إلغاء العلامة

# cannot_edit_item
source: Cannot edit this item
ar: لا يمكن تعديل هذا العنصر

# could_not_find_plan_for_occurrence
source: Could not find plan for this occurrence
ar: تعذر العثور على الخطة لهذا الحدث

source: Delete
ar: حذف

# delete_occurrence_title
source: Delete occurrence
ar: حذف الحدث

# delete_occurrence_text
source: Are you sure you want to delete this occurrence?
ar: هل أنت متأكد أنك تريد حذف هذا الحدث؟

source: How many times on {day}
ar: كم مرة في {day}

source: Select start date
ar: اختر تاريخ البداية

source: Select end date
ar: اختر تاريخ الانتهاء

# start_end_dates_required
source: Start and end dates are required
ar: تواريخ البداية والانتهاء مطلوبة

# start_date_before_or_equal_end_date
source: Start date must be before or equal to end date
ar: يجب أن يكون تاريخ البداية قبل أو يساوي تاريخ الانتهاء

source: Medicine added
ar: تمت إضافة الدواء

source: Failed to add medicine
ar: فشل في إضافة الدواء

source: Nothing to save
ar: لا يوجد شيء لحفظه

source: Saved
ar: تم الحفظ

source: Name is required
ar: الاسم مطلوب

# dose_must_be_greater_than_zero
source: Dose must be greater than 0
ar: يجب أن تكون الجرعة أكبر من 0

source: Times per day required
ar: عدد المرات في اليوم مطلوب

# start_date_must_before_end_date
source: Start date must be before end date
ar: يجب أن يكون تاريخ البداية قبل تاريخ الانتهاء

source: Today taken
ar: تم تناوله اليوم

source: Medicines Progress
ar: تقدم الأدوية

source: Unnamed
ar: بدون اسم

source: Removed
ar: تم الحذف

source: Failed to remove
ar: فشل الحذف

source: Enter number of days
ar: أدخل عدد الأيام

source: Select weekdays
ar: اختر أيام الأسبوع

source: Type is required
ar: النوع مطلوب

source: Unit is required
ar: الوحدة مطلوبة

source: Frequency is required
ar: التكرار مطلوب

source: Save Changes
ar: حفظ التغييرات

source: Times per day must be at least 1
ar: يجب أن يكون عدد المرات في اليوم على الأقل 1

source: Dosage must be greater than 0
ar: يجب أن تكون الجرعة أكبر من 0

source: Failed to save
ar: فشل الحفظ

source: No medicines for this day
ar: لا توجد أدوية لهذا اليوم

source: Edit Medicine
ar: تعديل الدواء

# confirm_action_title
source: Confirm {action}
ar: تأكيد {action}

# confirm_action_message
source: Are you sure you want to {action} this medicine?
ar: هل أنت متأكد أنك تريد {action} هذا الدواء؟

source: Yes
ar: نعم

source: No
ar: لا

source: Plan not found
ar: الخطة غير موجودة

# unexpected_error
source: Something went wrong
ar: حدث خطأ غير متوقع

source: Medicine Calendar
ar: تقويم الأدوية

source: View Report
ar: عرض التقرير

source: No medicine records for this date
ar: لا توجد سجلات أدوية لهذا التاريخ

source: How many times on {day}?
ar: كم مرة في اليوم؟
